In [45]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\acer\anaconda3\envs\conda_lumbini_env\lib\site-packages (2.0.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\acer\anaconda3\envs\conda_lumbini_env\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\acer\anaconda3\envs\conda_lumbini_env\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: tzdata>=2022.1 in c:\users\acer\anaconda3\envs\conda_lumbini_env\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in c:\users\acer\anaconda3\envs\conda_lumbini_env\lib\site-packages (from pandas) (1.25.2)
Requirement already satisfied: six>=1.5 in c:\users\acer\anaconda3\envs\conda_lumbini_env\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [46]:
pip install pandas

Requirement already satisfied: pandas in c:\users\acer\anaconda3\envs\conda_lumbini_env\lib\site-packages (2.0.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\acer\anaconda3\envs\conda_lumbini_env\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\acer\anaconda3\envs\conda_lumbini_env\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: tzdata>=2022.1 in c:\users\acer\anaconda3\envs\conda_lumbini_env\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in c:\users\acer\anaconda3\envs\conda_lumbini_env\lib\site-packages (from pandas) (1.25.2)
Requirement already satisfied: six>=1.5 in c:\users\acer\anaconda3\envs\conda_lumbini_env\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [8]:
import pandas as pd

In [9]:
python_dict={"Name":["prabhat","shiva","alisha","ram"],"age":[10,29,39,32]}

In [10]:
df=pd.DataFrame(python_dict)
df

      Name  age
0  prabhat   10
1    shiva   29
2   alisha   39
3      ram   32

In [11]:
df = pd.DataFrame([('Prabhat', 24,'Male'),
                  ('Ram', 23, 'Male'),
                  ('Shyam', 32, 'Male'),
                  ('Asmita', 21, 'Female'),
                  ('Alisha', 20, 'Female')],
                 columns = ['Name', 'Age', 'Gender'])

In [12]:
df

      Name  Age  Gender
0  Prabhat   24    Male
1      Ram   23    Male
2    Shyam   32    Male
3   Asmita   21  Female
4   Alisha   20  Female

In [13]:
df = pd.DataFrame([['Prabhat', 24,'Male'],
                  ['Ram', 23, 'Male'],
                  ['Shyam', 32, 'Male'],
                  ['Asmita', 21, 'Female'],
                  ['Alisha', 20, 'Female']],
                 columns = ['Name', 'Age', 'Gender'])

In [14]:
df

      Name  Age  Gender
0  Prabhat   24    Male
1      Ram   23    Male
2    Shyam   32    Male
3   Asmita   21  Female
4   Alisha   20  Female

In [15]:
import os

In [16]:
os.listdir(os.path.dirname(os.getcwd()))

['.bash_history',
 '.conda',
 '.condarc',
 '.continuum',
 '.git',
 '.gitconfig',
 '.gitignore',
 '.ipynb_checkpoints',
 '.ipython',
 '.jupyter',
 '.lesshst',
 '.ms-ad',
 '.rest-client',
 '.VirtualBox',
 '.vscode',
 'aaa.txt',
 'adminhub',
 'anaconda3',
 'AppData',
 'Application Data',
 'c++',
 'Cookies',
 'CV-Generator',
 'Downloads',
 'html',
 'IntelGraphicsProfiles',
 'intro.txt',
 'Local Settings',
 'My Documents',
 'myenv',
 'NetHood',
 'NTUSER.DAT',
 'ntuser.dat.LOG1',
 'ntuser.dat.LOG2',
 'NTUSER.DAT{53b39e88-18c4-11ea-a811-000d3aa4692b}.TM.blf',
 'NTUSER.DAT{53b39e88-18c4-11ea-a811-000d3aa4692b}.TMContainer00000000000000000001.regtrans-ms',
 'NTUSER.DAT{53b39e88-18c4-11ea-a811-000d3aa4692b}.TMContainer00000000000000000002.regtrans-ms',
 'ntuser.ini',
 'OneDrive',
 'OneDrive - Lumbini City College',
 'package-lock.json',
 'package.json',
 'PrintHood',
 'public',
 'PYTHON',
 'README.md',
 'Recent',
 'SendTo',
 'src',
 'Start Menu',
 'Templates',
 'Untitled.ipynb',
 'untitled.txt',
 'Untitled1.ipynb',
 'untitled1.txt']

In [17]:
path_to_csv_data=os.path.join(os.path.dirname(os.getcwd()),"csv_data,"weather_data.csv")
    print(path_to_csv_data)

SyntaxError: unterminated string literal (detected at line 1) (2550951604.py, line 1)

In [18]:
from csv import reader

In [19]:
csv_file = open('weather_data.csv')
file_read = reader(csv_file)
data = list(file_read)
print(data)

[['kfjkdfjskd'], ['dfuhsdjufio'], ['day', 'temperature', 'windspeed', 'event'], ['1/1/2017', '32', '6', 'Rain'], ['1/4/2017', 'not available', '9', 'Sunny'], ['1/5/2017', '-1', 'not measured', 'Snow'], ['1/6/2017', 'not available', '7', 'no event'], ['1/7/2017', '32', 'not measured', 'Rain'], ['1/8/2017', 'not available', 'not measured', 'Sunny'], ['1/9/2017', 'not available', 'not measured', 'no event'], ['1/10/2017', '34', '8', 'Cloudy'], ['1/11/2017', '-4', '-1', 'Snow'], ['1/12/2017', '26', '12', 'Sunny'], ['1/13/2017', '12', '12', 'Rainy'], ['1/11/2017', '-1', '12', 'Snow'], ['1/14/2017', '40', '-1', 'Sunny']]

In [20]:
weather_df = pd.read_csv('weather_data.csv', skiprows = 2,header=None)
names=['day','temperature','windspeed','event']
weather_df

            0              1             2         3
0         day    temperature     windspeed     event
1    1/1/2017             32             6      Rain
2    1/4/2017  not available             9     Sunny
3    1/5/2017             -1  not measured      Snow
4    1/6/2017  not available             7  no event
5    1/7/2017             32  not measured      Rain
6    1/8/2017  not available  not measured     Sunny
7    1/9/2017  not available  not measured  no event
8   1/10/2017             34             8    Cloudy
9   1/11/2017             -4            -1      Snow
10  1/12/2017             26            12     Sunny
11  1/13/2017             12            12     Rainy
12  1/11/2017             -1            12      Snow
13  1/14/2017             40            -1     Sunny

In [21]:
df.to_csv("weather_of_eight_days.csv",index=None)

In [22]:
pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\acer\anaconda3\envs\conda_lumbini_env\lib\site-packages (3.1.2)
Requirement already satisfied: et-xmlfile in c:\users\acer\anaconda3\envs\conda_lumbini_env\lib\site-packages (from openpyxl) (1.1.0)
Note: you may need to restart the kernel to use updated packages.

In [23]:
df.columns

Index(['Name', 'Age', 'Gender'], dtype='object')

In [ ]:
df.values

In [25]:
weather_df.columns

Index([0, 1, 2, 3], dtype='int64')

In [26]:
weather_df.values

array([['day', 'temperature', 'windspeed', 'event'],
       ['1/1/2017', '32', '6', 'Rain'],
       ['1/4/2017', 'not available', '9', 'Sunny'],
       ['1/5/2017', '-1', 'not measured', 'Snow'],
       ['1/6/2017', 'not available', '7', 'no event'],
       ['1/7/2017', '32', 'not measured', 'Rain'],
       ['1/8/2017', 'not available', 'not measured', 'Sunny'],
       ['1/9/2017', 'not available', 'not measured', 'no event'],
       ['1/10/2017', '34', '8', 'Cloudy'],
       ['1/11/2017', '-4', '-1', 'Snow'],
       ['1/12/2017', '26', '12', 'Sunny'],
       ['1/13/2017', '12', '12', 'Rainy'],
       ['1/11/2017', '-1', '12', 'Snow'],
       ['1/14/2017', '40', '-1', 'Sunny']], dtype=object)

In [27]:
df

      Name  Age  Gender
0  Prabhat   24    Male
1      Ram   23    Male
2    Shyam   32    Male
3   Asmita   21  Female
4   Alisha   20  Female

In [28]:
df.set_index('Name')

         Age  Gender
Name
Prabhat   24    Male
Ram       23    Male
Shyam     32    Male
Asmita    21  Female
Alisha    20  Female

In [29]:
df.dtypes

Name      object
Age        int64
Gender    object
dtype: object

In [30]:
df.head()

      Name  Age  Gender
0  Prabhat   24    Male
1      Ram   23    Male
2    Shyam   32    Male
3   Asmita   21  Female
4   Alisha   20  Female

In [31]:
df['weight']=[32.4,34,54,35,21]

In [32]:
df.head()

      Name  Age  Gender  weight
0  Prabhat   24    Male    32.4
1      Ram   23    Male    34.0
2    Shyam   32    Male    54.0
3   Asmita   21  Female    35.0
4   Alisha   20  Female    21.0

In [33]:
df.dtypes

Name       object
Age         int64
Gender     object
weight    float64
dtype: object

In [34]:
df.shape

(5, 4)

In [35]:
weather_df.shape

(14, 4)

In [36]:
weather_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       14 non-null     object
 1   1       14 non-null     object
 2   2       14 non-null     object
 3   3       14 non-null     object
dtypes: object(4)
memory usage: 576.0+ bytes

In [37]:
weather_df

            0              1             2         3
0         day    temperature     windspeed     event
1    1/1/2017             32             6      Rain
2    1/4/2017  not available             9     Sunny
3    1/5/2017             -1  not measured      Snow
4    1/6/2017  not available             7  no event
5    1/7/2017             32  not measured      Rain
6    1/8/2017  not available  not measured     Sunny
7    1/9/2017  not available  not measured  no event
8   1/10/2017             34             8    Cloudy
9   1/11/2017             -4            -1      Snow
10  1/12/2017             26            12     Sunny
11  1/13/2017             12            12     Rainy
12  1/11/2017             -1            12      Snow
13  1/14/2017             40            -1     Sunny

In [97]:
os.path.join(os.path.dirname(os.getcwd()),'csv_data','weather_data_nan.csv')

'C:\\Users\\Acer\\csv_data\\weather_data_nan.csv'

In [101]:
wather_df_nan=pd.read_csv('weather_data_nan.csv')

In [103]:
weather_df_nan

NameError: name 'weather_df_nan' is not defined

In [52]:
new_weather_df.index()

NameError: name 'new_weather_df' is not defined

In [53]:
weather_df = weather_df.set_index('day')

KeyError: "None of ['day'] are in the columns"

In [54]:
weather_df

            0              1             2         3
0         day    temperature     windspeed     event
1    1/1/2017             32             6      Rain
2    1/4/2017  not available             9     Sunny
3    1/5/2017             -1  not measured      Snow
4    1/6/2017  not available             7  no event
5    1/7/2017             32  not measured      Rain
6    1/8/2017  not available  not measured     Sunny
7    1/9/2017  not available  not measured  no event
8   1/10/2017             34             8    Cloudy
9   1/11/2017             -4            -1      Snow
10  1/12/2017             26            12     Sunny
11  1/13/2017             12            12     Rainy
12  1/11/2017             -1            12      Snow
13  1/14/2017             40            -1     Sunny

In [55]:
weather_df.loc[0,'event']

KeyError: 'event'

In [115]:
path_to_appointment_data=os.path.join(os.path.dirname(os.getcwd()),'csvdata,appointment_schedule.csv')

In [116]:
appointment_schedule_df = pd.read_csv('appointment_schedule.csv')
appointment_schedule_df.head()

,name,appointment_made_date,app_start_date,app_end_date,visitee_namelast,visitee_namefirst,meeting_room,description
0,Joshua T. Blanton,2014-12-18T00:00:00,1/6/15 9:30,1/6/15 23:59,NaN,potus,west wing,JointService Military Honor Guard
1,Jack T. Gutting,2014-12-18T00:00:00,1/6/15 9:30,1/6/15 23:59,NaN,potus,west wing,JointService Military Honor Guard
2,Bradley T. Guiles,2014-12-18T00:00:00,1/6/15 9:30,1/6/15 23:59,NaN,potus,west wing,JointService Military Honor Guard
3,Loryn F. Grieb,2014-12-18T00:00:00,1/6/15 9:30,1/6/15 23:59,NaN,potus,west wing,JointService Military Honor Guard
4,Travis D. Gordon,2014-12-18T00:00:00,1/6/15 9:30,1/6/15 23:59,NaN,potus,west wing,JointService Military Honor Guard

In [58]:
appointment_names = appointment_schedule_df['name']
name_type = type(appointment_names)

In [59]:
appointment_names

0        Joshua T. Blanton
1          Jack T. Gutting
2        Bradley T. Guiles
3           Loryn F. Grieb
4         Travis D. Gordon
              ...
580         Ryan J. Morgan
581    Alexander V. Nevsky
582     Montana J. Johnson
583    Joseph A. Pritchard
584        Martin O. Reina
Name: name, Length: 585, dtype: object

In [60]:
weather_df_nan['temp_in_kelvin']=weather_df_nan['temperature']

NameError: name 'weather_df_nan' is not defined

In [61]:
weather_df_nan.loc[:, ['temperature', 'event']]

NameError: name 'weather_df_nan' is not defined

In [62]:
path_to_car_data=os.path.join(os.path.dirname(os.getcwd()),'csv_data','car_details.csv')

In [63]:
car_details= car_details_df['name']
name_type = type(car_details)

NameError: name 'car_details_df' is not defined

In [64]:
car_details_df = pd.read_csv('car_details.csv')
car_details_df.head()

,name,year,selling_price,km_driven,fuel,seller_type,transmission,owner
0,Maruti 800 AC,2007,60000,70000,Petrol,Individual,Manual,First Owner
1,Maruti Wagon R LXI Minor,2007,135000,50000,Petrol,Individual,Manual,First Owner
2,Hyundai Verna 1.6 SX,2012,600000,100000,Diesel,Individual,Manual,First Owner
3,Datsun RediGO T Option,2017,250000,46000,Petrol,Individual,Manual,First Owner
4,Honda Amaze VX i-DTEC,2014,450000,141000,Diesel,Individual,Manual,Second Owner

In [65]:
car_details_df.loc[5:10,'selling_price']

5     140000
6     550000
7     240000
8     850000
9     365000
10    260000
Name: selling_price, dtype: int64

In [66]:
car_details_df['fuel'].value_counts()

fuel
Diesel      2153
Petrol      2123
CNG           40
LPG           23
Electric       1
Name: count, dtype: int64

In [67]:
car_details_df['selling_price'].describe()

count    4.340000e+03
mean     5.041273e+05
std      5.785487e+05
min      2.000000e+04
25%      2.087498e+05
50%      3.500000e+05
75%      6.000000e+05
max      8.900000e+06
Name: selling_price, dtype: float64

In [68]:
10**5

100000

In [69]:
car_details_df.describe()

              year  selling_price      km_driven
count  4340.000000   4.340000e+03    4340.000000
mean   2013.090783   5.041273e+05   66215.777419
std       4.215344   5.785487e+05   46644.102194
min    1992.000000   2.000000e+04       1.000000
25%    2011.000000   2.087498e+05   35000.000000
50%    2014.000000   3.500000e+05   60000.000000
75%    2016.000000   6.000000e+05   90000.000000
max    2020.000000   8.900000e+06  806599.000000

In [70]:
car_df=car_details_df.rename({"year":"make_year"},axis=1)

In [71]:
car_df

,name,make_year,selling_price,km_driven,fuel,seller_type,transmission,owner
0,Maruti 800 AC,2007,60000,70000,Petrol,Individual,Manual,First Owner
1,Maruti Wagon R LXI Minor,2007,135000,50000,Petrol,Individual,Manual,First Owner
2,Hyundai Verna 1.6 SX,2012,600000,100000,Diesel,Individual,Manual,First Owner
3,Datsun RediGO T Option,2017,250000,46000,Petrol,Individual,Manual,First Owner
4,Honda Amaze VX i-DTEC,2014,450000,141000,Diesel,Individual,Manual,Second Owner
...,...,...,...,...,...,...,...,...
4335,Hyundai i20 Magna 1.4 CRDi (Diesel),2014,409999,80000,Diesel,Individual,Manual,Second Owner
4336,Hyundai i20 Magna 1.4 CRDi,2014,409999,80000,Diesel,Individual,Manual,Second Owner
4337,Maruti 800 AC BSIII,2009,110000,83000,Petrol,Individual,Manual,Second Owner
4338,Hyundai Creta 1.6 CRDi SX Option,2016,865000,90000,Diesel,Individual,Manual,First Owner
4339,Renault KWID RXT,2016,225000,40000,Petrol,Individual,Manual,First Owner

In [72]:
car_details_df['name'][0]

'Maruti 800 AC'

In [73]:
car_details_df['car_age']=2023-car_df['make_year']

In [74]:
car_details_df['car_age']

0       16
1       16
2       11
3        6
4        9
        ..
4335     9
4336     9
4337    14
4338     7
4339     7
Name: car_age, Length: 4340, dtype: int64

In [75]:
car_details_df['car_age']=2023+car_df['make_year']

In [76]:
car_details_df['car_age']

0       4030
1       4030
2       4035
3       4040
4       4037
        ...
4335    4037
4336    4037
4337    4032
4338    4039
4339    4039
Name: car_age, Length: 4340, dtype: int64

In [77]:
car_df.loc[car_df['fuel']=="Petrol", "selling_price"].max()

8900000

In [78]:
car_df["selling_price"].mean()

504127.3117511521

In [79]:
car_df["fuel"].mode()

0    Diesel
Name: fuel, dtype: object

In [80]:
car_df.describe()

         make_year  selling_price      km_driven
count  4340.000000   4.340000e+03    4340.000000
mean   2013.090783   5.041273e+05   66215.777419
std       4.215344   5.785487e+05   46644.102194
min    1992.000000   2.000000e+04       1.000000
25%    2011.000000   2.087498e+05   35000.000000
50%    2014.000000   3.500000e+05   60000.000000
75%    2016.000000   6.000000e+05   90000.000000
max    2020.000000   8.900000e+06  806599.000000

In [81]:
car_df.describe(include="O")

                          name    fuel seller_type transmission        owner
count                     4340    4340        4340         4340         4340
unique                    1491       5           3            2            5
top     Maruti Swift Dzire VDI  Diesel  Individual       Manual  First Owner
freq                        69    2153        3244         3892         2832

In [82]:
car_df.loc[0,'name']="Maruti 900 AC"

In [83]:
car_df.head()

,name,make_year,selling_price,km_driven,fuel,seller_type,transmission,owner
0,Maruti 900 AC,2007,60000,70000,Petrol,Individual,Manual,First Owner
1,Maruti Wagon R LXI Minor,2007,135000,50000,Petrol,Individual,Manual,First Owner
2,Hyundai Verna 1.6 SX,2012,600000,100000,Diesel,Individual,Manual,First Owner
3,Datsun RediGO T Option,2017,250000,46000,Petrol,Individual,Manual,First Owner
4,Honda Amaze VX i-DTEC,2014,450000,141000,Diesel,Individual,Manual,Second Owner

In [84]:
car_df[car_df['fuel']=="Electric"]

,name,make_year,selling_price,km_driven,fuel,seller_type,transmission,owner
4145,Toyota Camry Hybrid,2006,310000,62000,Electric,Dealer,Automatic,Second Owner

In [85]:
import os

In [86]:
path_to_null_weather=os.path.join(os.path.dirname(os.getcwd()),'csv_data','weather_data_nan.csv')

In [87]:
weather_df_nan(weather_df_nan['temperature'].isna(),'temperature')==20

NameError: name 'weather_df_nan' is not defined

In [88]:
path_to_fortune_data=os.path.join(os.path.dirname(os.getcwd()),'csv_data','Fortune_1000.csv')

In [89]:
fortune_df

NameError: name 'fortune_df' is not defined

In [90]:
fortune_df.isnull().sum()

NameError: name 'fortune_df' is not defined

In [91]:
car_df.sort_values("fuel",ascending=False).reset_index(drop=True)

,name,make_year,selling_price,km_driven,fuel,seller_type,transmission,owner
0,Maruti 900 AC,2007,60000,70000,Petrol,Individual,Manual,First Owner
1,Audi A4 30 TFSI Technology,2018,3100000,22000,Petrol,Individual,Automatic,First Owner
2,Maruti Ciaz 1.4 Alpha,2018,925000,20000,Petrol,Individual,Manual,First Owner
3,Toyota Camry M/t,2008,650000,75000,Petrol,Individual,Manual,Second Owner
4,Maruti Alto K10 LXI,2010,175000,64000,Petrol,Dealer,Manual,First Owner
...,...,...,...,...,...,...,...,...
4335,Maruti Eeco CNG 5 Seater AC BSIV,2019,470000,10000,CNG,Individual,Manual,First Owner
4336,Hyundai Santro Xing GL PLUS CNG,2007,90000,80000,CNG,Individual,Manual,Third Owner
4337,Maruti Eeco 5 STR With AC Plus HTR CNG,2012,229999,75000,CNG,Dealer,Manual,First Owner
4338,Tata Indigo CS Emax CNG GLX,2014,185000,72000,CNG,Dealer,Manual,First Owner
4339,Maruti Alto 800 CNG LXI Optional,2019,300000,120000,CNG,Individual,Manual,First Owner

In [92]:
car_df

,name,make_year,selling_price,km_driven,fuel,seller_type,transmission,owner
0,Maruti 900 AC,2007,60000,70000,Petrol,Individual,Manual,First Owner
1,Maruti Wagon R LXI Minor,2007,135000,50000,Petrol,Individual,Manual,First Owner
2,Hyundai Verna 1.6 SX,2012,600000,100000,Diesel,Individual,Manual,First Owner
3,Datsun RediGO T Option,2017,250000,46000,Petrol,Individual,Manual,First Owner
4,Honda Amaze VX i-DTEC,2014,450000,141000,Diesel,Individual,Manual,Second Owner
...,...,...,...,...,...,...,...,...
4335,Hyundai i20 Magna 1.4 CRDi (Diesel),2014,409999,80000,Diesel,Individual,Manual,Second Owner
4336,Hyundai i20 Magna 1.4 CRDi,2014,409999,80000,Diesel,Individual,Manual,Second Owner
4337,Maruti 800 AC BSIII,2009,110000,83000,Petrol,Individual,Manual,Second Owner
4338,Hyundai Creta 1.6 CRDi SX Option,2016,865000,90000,Diesel,Individual,Manual,First Owner
4339,Renault KWID RXT,2016,225000,40000,Petrol,Individual,Manual,First Owner

In [104]:
car_df['car_brand'] = car_df['name'].str.split(' ').str[0]

In [105]:
car_df

,name,make_year,selling_price,km_driven,fuel,seller_type,transmission,owner,car_brand
0,Maruti 900 AC,2007,60000,70000,Petrol,Individual,Manual,First Owner,Maruti
1,Maruti Wagon R LXI Minor,2007,135000,50000,Petrol,Individual,Manual,First Owner,Maruti
2,Hyundai Verna 1.6 SX,2012,600000,100000,Diesel,Individual,Manual,First Owner,Hyundai
3,Datsun RediGO T Option,2017,250000,46000,Petrol,Individual,Manual,First Owner,Datsun
4,Honda Amaze VX i-DTEC,2014,450000,141000,Diesel,Individual,Manual,Second Owner,Honda
...,...,...,...,...,...,...,...,...,...
4335,Hyundai i20 Magna 1.4 CRDi (Diesel),2014,409999,80000,Diesel,Individual,Manual,Second Owner,Hyundai
4336,Hyundai i20 Magna 1.4 CRDi,2014,409999,80000,Diesel,Individual,Manual,Second Owner,Hyundai
4337,Maruti 800 AC BSIII,2009,110000,83000,Petrol,Individual,Manual,Second Owner,Maruti
4338,Hyundai Creta 1.6 CRDi SX Option,2016,865000,90000,Diesel,Individual,Manual,First Owner,Hyundai
4339,Renault KWID RXT,2016,225000,40000,Petrol,Individual,Manual,First Owner,Renault

In [109]:
car_df.groupby('car_brand')['selling_price'].mean()

car_brand
Ambassador       1.800000e+05
Audi             1.931633e+06
BMW              2.945385e+06
Chevrolet        2.367271e+05
Daewoo           6.000000e+04
Datsun           2.970269e+05
Fiat             2.834324e+05
Force            3.460000e+05
Ford             5.712731e+05
Honda            5.381468e+05
Hyundai          4.199403e+05
Isuzu            1.500000e+06
Jaguar           2.069166e+06
Jeep             1.530000e+06
Kia              1.300000e+06
Land             3.609800e+06
MG               1.842500e+06
Mahindra         5.877095e+05
Maruti           3.424163e+05
Mercedes-Benz    2.776657e+06
Mitsubishi       8.400000e+05
Nissan           4.499375e+05
OpelCorsa        8.850000e+04
Renault          4.193767e+05
Skoda            4.900147e+05
Tata             2.840834e+05
Toyota           9.243592e+05
Volkswagen       4.710373e+05
Volvo            2.556250e+06
Name: selling_price, dtype: float64

In [112]:
car_df.groupby('car_Brand')['make_year].last()

SyntaxError: unterminated string literal (detected at line 1) (1423750795.py, line 1)

In [114]:
car_df.groupby('owner')['km_driven'].last()

owner
First Owner              40000
Fourth & Above Owner     60000
Second Owner             83000
Test Drive Car           13000
Third Owner             175000
Name: km_driven, dtype: int64

In [117]:
df3 = pd.DataFrame({"Gender": ["Male", "Male", "Male", "Female", "Female",
                              "Male", "Female", "Male", "Male", "Male"], 
                   "Height": [1.6, 1.7, 1.5, 1.6, 1.65, 1.72, 1.43, 1.8, 1.71, 1.42],
                   "Weight": [70, 67, 65, 45, 48, 73, 55, 82, 67, 55]})
df3.head()

   Gender  Height  Weight
0    Male    1.60      70
1    Male    1.70      67
2    Male    1.50      65
3  Female    1.60      45
4  Female    1.65      48

In [122]:
df1 = pd.DataFrame({"name": ['Prabhat', 'Hari', 'Shiva', 'Bhawana', 'Mahima', 'Sunil'],
                  "age": [24,34,50,32,18,23],
                  "address": ["Manigram", "Dhanewa", "Bardaghat", 
                             "Manglapur", "Bharatpur", "Kathmandu"]})
df1.head()

      name  age    address
0  Prabhat   24   Manigram
1     Hari   34    Dhanewa
2    Shiva   50  Bardaghat
3  Bhawana   32  Manglapur
4   Mahima   18  Bharatpur

In [128]:
fortune_df = pd.read_csv('csv_data/Fortune_1000.csv)
    print(fortune_df.shape)

SyntaxError: unterminated string literal (detected at line 1) (3455816782.py, line 1)

In [1]:
customer_details="30"
customer_hel="your bill is"
customer_tel=customer_hel + ' ' + customer_details
print(customer_tel)

your bill is 30